podonoghue/usbdm-firmware/BootloopMKL/Project_Headers/MKL25Z32M4.h
/* TPM2 - Peripheral instance base addresses */
#define TPM2_BasePtr                   0x4003A000UL //!< Peripheral base address
#define TPM2                           ((TPM1_Type *) TPM2_BasePtr) //!< Freescale base pointer
#define TPM2_BASE_PTR                  (TPM2) //!< Freescale style base pointer
/**
 * @} */ /* End group TPM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup TSI_Peripheral_access_layer_GROUP TSI Peripheral Access Layer
* @brief C Struct for TSI
* @{
*/

/* ================================================================================ */
/* ================           TSI0 (file:TSI0_MKL)                 ================ */
/* ================================================================================ */

/**
 * @brief Touch Sensing Input
 */
/**
* @addtogroup TSI_structs_GROUP TSI struct
* @brief Struct for TSI
* @{
*/
typedef struct {                                /*       TSI0 Structure                                               */
   __IO uint32_t  GENCS;                        /**< 0000: TSI General Control and Status Register                      */
   __IO uint32_t  DATA;                         /**< 0004: TSI DATA Register                                            */
   __IO uint32_t  TSHD;                         /**< 0008: TSI Threshold Register                                       */
} TSI_Type;

/**
 * @} */ /* End group TSI_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'TSI0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup TSI_Register_Masks_GROUP TSI Register Masks
* @brief Register Masks for TSI
* @{
*/
/* ------- GENCS Bit Fields                         ------ */
#define TSI_GENCS_CURSW_MASK                     (0x01UL << TSI_GENCS_CURSW_SHIFT)                   /*!< TSI0_GENCS: CURSW Mask                  */
#define TSI_GENCS_CURSW_SHIFT                    1                                                   /*!< TSI0_GENCS: CURSW Position              */
#define TSI_GENCS_EOSF_MASK                      (0x01UL << TSI_GENCS_EOSF_SHIFT)                    /*!< TSI0_GENCS: EOSF Mask                   */
#define TSI_GENCS_EOSF_SHIFT                     2                                                   /*!< TSI0_GENCS: EOSF Position               */
#define TSI_GENCS_SCNIP_MASK                     (0x01UL << TSI_GENCS_SCNIP_SHIFT)                   /*!< TSI0_GENCS: SCNIP Mask                  */
#define TSI_GENCS_SCNIP_SHIFT                    3                                                   /*!< TSI0_GENCS: SCNIP Position              */
#define TSI_GENCS_STM_MASK                       (0x01UL << TSI_GENCS_STM_SHIFT)                     /*!< TSI0_GENCS: STM Mask                    */
#define TSI_GENCS_STM_SHIFT                      4                                                   /*!< TSI0_GENCS: STM Position                */
#define TSI_GENCS_STPE_MASK                      (0x01UL << TSI_GENCS_STPE_SHIFT)                    /*!< TSI0_GENCS: STPE Mask                   */
#define TSI_GENCS_STPE_SHIFT                     5                                                   /*!< TSI0_GENCS: STPE Position               */
#define TSI_GENCS_TSIIEN_MASK                    (0x01UL << TSI_GENCS_TSIIEN_SHIFT)                  /*!< TSI0_GENCS: TSIIEN Mask                 */
#define TSI_GENCS_TSIIEN_SHIFT                   6                                                   /*!< TSI0_GENCS: TSIIEN Position             */
#define TSI_GENCS_TSIEN_MASK                     (0x01UL << TSI_GENCS_TSIEN_SHIFT)                   /*!< TSI0_GENCS: TSIEN Mask                  */
#define TSI_GENCS_TSIEN_SHIFT                    7                                                   /*!< TSI0_GENCS: TSIEN Position              */
#define TSI_GENCS_NSCN_MASK                      (0x1FUL << TSI_GENCS_NSCN_SHIFT)                    /*!< TSI0_GENCS: NSCN Mask                   */
#define TSI_GENCS_NSCN_SHIFT                     8                                                   /*!< TSI0_GENCS: NSCN Position               */
#define TSI_GENCS_NSCN(x)                        (((uint32_t)(((uint32_t)(x))<<TSI_GENCS_NSCN_SHIFT))&TSI_GENCS_NSCN_MASK) /*!< TSI0_GENCS                              */
#define TSI_GENCS_PS_MASK                        (0x07UL << TSI_GENCS_PS_SHIFT)                      /*!< TSI0_GENCS: PS Mask                     */
#define TSI_GENCS_PS_SHIFT                       13                                                  /*!< TSI0_GENCS: PS Position                 */
#define TSI_GENCS_PS(x)                          (((uint32_t)(((uint32_t)(x))<<TSI_GENCS_PS_SHIFT))&TSI_GENCS_PS_MASK) /*!< TSI0_GENCS                              */
#define TSI_GENCS_EXTCHRG_MASK                   (0x07UL << TSI_GENCS_EXTCHRG_SHIFT)                 /*!< TSI0_GENCS: EXTCHRG Mask                */
#define TSI_GENCS_EXTCHRG_SHIFT                  16                                                  /*!< TSI0_GENCS: EXTCHRG Position            */
#define TSI_GENCS_EXTCHRG(x)                     (((uint32_t)(((uint32_t)(x))<<TSI_GENCS_EXTCHRG_SHIFT))&TSI_GENCS_EXTCHRG_MASK) /*!< TSI0_GENCS                              */
#define TSI_GENCS_DVOLT_MASK                     (0x03UL << TSI_GENCS_DVOLT_SHIFT)                   /*!< TSI0_GENCS: DVOLT Mask                  */
#define TSI_GENCS_DVOLT_SHIFT                    19                                                  /*!< TSI0_GENCS: DVOLT Position              */
#define TSI_GENCS_DVOLT(x)                       (((uint32_t)(((uint32_t)(x))<<TSI_GENCS_DVOLT_SHIFT))&TSI_GENCS_DVOLT_MASK) /*!< TSI0_GENCS                              */
#define TSI_GENCS_REFCHRG_MASK                   (0x07UL << TSI_GENCS_REFCHRG_SHIFT)                 /*!< TSI0_GENCS: REFCHRG Mask                */
#define TSI_GENCS_REFCHRG_SHIFT                  21                                                  /*!< TSI0_GENCS: REFCHRG Position            */
#define TSI_GENCS_REFCHRG(x)                     (((uint32_t)(((uint32_t)(x))<<TSI_GENCS_REFCHRG_SHIFT))&TSI_GENCS_REFCHRG_MASK) /*!< TSI0_GENCS                              */
#define TSI_GENCS_MODE_MASK                      (0x0FUL << TSI_GENCS_MODE_SHIFT)                    /*!< TSI0_GENCS: MODE Mask                   */
#define TSI_GENCS_MODE_SHIFT                     24                                                  /*!< TSI0_GENCS: MODE Position               */
#define TSI_GENCS_MODE(x)                        (((uint32_t)(((uint32_t)(x))<<TSI_GENCS_MODE_SHIFT))&TSI_GENCS_MODE_MASK) /*!< TSI0_GENCS                              */
#define TSI_GENCS_ESOR_MASK                      (0x01UL << TSI_GENCS_ESOR_SHIFT)                    /*!< TSI0_GENCS: ESOR Mask                   */
#define TSI_GENCS_ESOR_SHIFT                     28                                                  /*!< TSI0_GENCS: ESOR Position               */
#define TSI_GENCS_OUTRGF_MASK                    (0x01UL << TSI_GENCS_OUTRGF_SHIFT)                  /*!< TSI0_GENCS: OUTRGF Mask                 */
#define TSI_GENCS_OUTRGF_SHIFT                   31                                                  /*!< TSI0_GENCS: OUTRGF Position             */
/* ------- DATA Bit Fields                          ------ */
#define TSI_DATA_TSICNT_MASK                     (0xFFFFUL << TSI_DATA_TSICNT_SHIFT)                 /*!< TSI0_DATA: TSICNT Mask                  */
#define TSI_DATA_TSICNT_SHIFT                    0                                                   /*!< TSI0_DATA: TSICNT Position              */
#define TSI_DATA_TSICNT(x)                       (((uint32_t)(((uint32_t)(x))<<TSI_DATA_TSICNT_SHIFT))&TSI_DATA_TSICNT_MASK) /*!< TSI0_DATA                               */
#define TSI_DATA_SWTS_MASK                       (0x01UL << TSI_DATA_SWTS_SHIFT)                     /*!< TSI0_DATA: SWTS Mask                    */
#define TSI_DATA_SWTS_SHIFT                      22                                                  /*!< TSI0_DATA: SWTS Position                */
#define TSI_DATA_DMAEN_MASK                      (0x01UL << TSI_DATA_DMAEN_SHIFT)                    /*!< TSI0_DATA: DMAEN Mask                   */
#define TSI_DATA_DMAEN_SHIFT                     23                                                  /*!< TSI0_DATA: DMAEN Position               */
#define TSI_DATA_TSICH_MASK                      (0x0FUL << TSI_DATA_TSICH_SHIFT)                    /*!< TSI0_DATA: TSICH Mask                   */
#define TSI_DATA_TSICH_SHIFT                     28                                                  /*!< TSI0_DATA: TSICH Position               */
#define TSI_DATA_TSICH(x)                        (((uint32_t)(((uint32_t)(x))<<TSI_DATA_TSICH_SHIFT))&TSI_DATA_TSICH_MASK) /*!< TSI0_DATA                               */
/* ------- TSHD Bit Fields                          ------ */
#define TSI_TSHD_THRESL_MASK                     (0xFFFFUL << TSI_TSHD_THRESL_SHIFT)                 /*!< TSI0_TSHD: THRESL Mask                  */
#define TSI_TSHD_THRESL_SHIFT                    0                                                   /*!< TSI0_TSHD: THRESL Position              */
#define TSI_TSHD_THRESL(x)                       (((uint32_t)(((uint32_t)(x))<<TSI_TSHD_THRESL_SHIFT))&TSI_TSHD_THRESL_MASK) /*!< TSI0_TSHD                               */
#define TSI_TSHD_THRESH_MASK                     (0xFFFFUL << TSI_TSHD_THRESH_SHIFT)                 /*!< TSI0_TSHD: THRESH Mask                  */
#define TSI_TSHD_THRESH_SHIFT                    16                                                  /*!< TSI0_TSHD: THRESH Position              */
#define TSI_TSHD_THRESH(x)                       (((uint32_t)(((uint32_t)(x))<<TSI_TSHD_THRESH_SHIFT))&TSI_TSHD_THRESH_MASK) /*!< TSI0_TSHD                               */
/**
 * @} */ /* End group TSI_Register_Masks_GROUP 
 */

/* TSI0 - Peripheral instance base addresses */
#define TSI0_BasePtr                   0x40045000UL //!< Peripheral base address
#define TSI0                           ((TSI_Type *) TSI0_BasePtr) //!< Freescale base pointer
#define TSI0_BASE_PTR                  (TSI0) //!< Freescale style base pointer
/**
 * @} */ /* End group TSI_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup UART_Peripheral_access_layer_GROUP UART Peripheral Access Layer
* @brief C Struct for UART
* @{
*/

/* ================================================================================ */
/* ================           UART0 (file:UART0_MKL)               ================ */
/* ================================================================================ */

/**
 * @brief Universal Asynchronous Receiver/Transmitter
 */
/**
* @addtogroup UART_structs_GROUP UART struct
* @brief Struct for UART
* @{
*/
typedef struct {                                /*       UART0 Structure                                              */
   __IO uint8_t   BDH;                          /**< 0000: Baud Rate Register: High                                     */
   __IO uint8_t   BDL;                          /**< 0001: Baud Rate Register: Low                                      */
   __IO uint8_t   C1;                           /**< 0002: Control Register 1                                           */
   __IO uint8_t   C2;                           /**< 0003: Control Register 2                                           */
   __IO uint8_t   S1;                           /**< 0004: Status Register 1                                            */
   __IO uint8_t   S2;                           /**< 0005: Status Register 2                                            */
   __IO uint8_t   C3;                           /**< 0006: Control Register 3                                           */
   __IO uint8_t   D;                            /**< 0007: Data Register                                                */
   __IO uint8_t   MA1;                          /**< 0008: Match Address Registers 1                                    */
   __IO uint8_t   MA2;                          /**< 0009: Match Address Registers 2                                    */
   __IO uint8_t   C4;                           /**< 000A: Control Register 4                                           */
   __IO uint8_t   C5;                           /**< 000B: Control Register 5                                           */
} UART0_Type;

/**
 * @} */ /* End group UART_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'UART0' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

